let errorList = {
	"0": "功能成功完成!",
	"-1": "添加出错!",
	"-2": "查找错误!",
	"-3": "用户已存在!",
	"-4": "两次密码不一致!",
	"-5": "用户名为空!",
	"-6": "密码为空!",
	"-7": "密码错误！",
	"-8": "用户不存在!",
	"-9": "修改错误!",
	"-10": "修改成功!",
	"-11": "删除错误!",
	"-12": "该用户未发送过验证码!",
	"-13": "验证码错误!",
	"-14": "添加成功!",
	"-15": "验证码已过期!",
	"-16": "删除成功!",
	"-17": "管理员不存在!",
	"-18": "您的余额不足!",
	"-19": "调整金额成功!",
	"-20": "广告添加成功!",
	"-21": "广告添加失败!",
	"-22": "商品不存在!",
	"-23": "您的余额不足!",
	"-24": "手机号为空!",
	"-25": "验证码为空!"
}
exports.adminType = {
	"0": "登录管理后台!",
	"1": "修改密码!",
	"2": "删除管理员",
	"3": "删除用户",
	"4": "金币调整",
	"5": "添加广告",
	"6": "删除商品",
	"7": "购买商品花费"
}
exports.advType = {
	"0": "轮播图",
	"1": "头部菜单"
}
exports.itemType = {
	"0": "首页推荐",
	"1": "推荐列表",
	"2": "超值精选",
	"3": "精选手机",
	"4": "手机列表",
	"5": "笔记本",
	"6": "精品平板",
	"7": "平板列表",
	"8": "智能穿戴",
	"9": "穿戴列表",
	"10": "智能家居",
	"11": "家居列表",
	"12": "热销配件",
	"13": "配件列表",
	"14": "品牌配件",
	"15": "品牌列表"
}
exports.errHandler = function(res, code) {
	res.send({
		code: code,
		msg: errorList[code]
	});
}